[
  {
    "custom_lo_id": "LO-C8-01",
    "learning_object_title": "Xác định tâm và tính bán kính đường tròn ngoại tiếp tam giác",
    "cognitive_level": "Thông hiểu",
    "description": "Cách xác định đường tròn ngoại tiếp tam giác",
    "objective": "Nhận biết được định nghĩa đường tròn ngoại tiếp tam giác. Xác định được tâm và bán kính đường tròn ngoại tiếp tam giác (đặc biệt: tam giác vuông, tam giác đều)",
    "lesson_title": "LESSON-00025"
  },
  {
    "custom_lo_id": "LO-C8-02",
    "learning_object_title": "Xác định tâm và tính bán kính đường tròn nội tiếp tam giác",
    "cognitive_level": "Thông hiểu",
    "description": "Cách xác định đường tròn nội tiếp tam giác",
    "objective": "Nhận biết được định nghĩa đường tròn nội tiếp tam giác. Xác định được tâm và bán kính đường tròn nội tiếp tam giác (tam giác đều)",
    "lesson_title": "LESSON-00025"
  },
  {
    "custom_lo_id": "LO-C8-03",
    "learning_object_title": "Bài toán liên quan đến đường tròn nội tiếp, ngoại tiếp tam giác",
    "cognitive_level": "Vận dụng cao",
    "description": "Sử dụng các tính chất của đường tròn nội tiếp, ngoại tiếp tam giác để giải quyết bài toán",
    "objective": "Liên hệ được các tính chất để chứng minh bài toán",
    "lesson_title": "LESSON-00025"
  },
  {
    "custom_lo_id": "LO-C8-04",
    "learning_object_title": "Tính góc của tứ giác nội tiếp đường tròn",
    "cognitive_level": "Thông hiểu",
    "description": "Tứ giác nội tiếp có tổng 2 góc đối nhau bằng 180 độ",
    "objective": "Tính được các góc trong tứ giác nội tiếp",
    "lesson_title": "LESSON-00026"
  },
  {
    "custom_lo_id": "LO-C8-05",
    "learning_object_title": "Tứ giác nội tiếp. Định lí về tổng hai góc đối của tứ giác nội tiếp bằng 180 độ",
    "cognitive_level": "Thông hiểu",
    "description": "Định nghĩa tứ giác nội tiếp. Các bước chứng minh tứ giác nội tiếp",
    "objective": "Nhận biết được tứ giác nội tiếp đường tròn và giải thích được định lí về tổng hai góc đối của tứ giác nội tiếp bằng 180 độ",
    "lesson_title": "LESSON-00026"
  },
  {
    "custom_lo_id": "LO-C8-06",
    "learning_object_title": "Tâm, bán kính đường tròn ngoại tiếp hình chữ nhật, hình vuông",
    "cognitive_level": "Vận dụng",
    "description": "Định nghĩa tâm và bán kính của đường tròn ngoại tiếp hình chữ nhật, hình vuông",
    "objective": "Xác định được tâm và bán kính đường tròn ngoại tiếp hình chữ nhật, hình vuông",
    "lesson_title": "LESSON-00026"
  },
  {
    "custom_lo_id": "LO-C8-07",
    "learning_object_title": "Ứng dụng thực tế",
    "cognitive_level": "Vận dụng",
    "description": "Chuyển bài toán thực tế thành các đại lượng toán học, sử dụng công thức tính theo yêu cầu đề bài",
    "objective": "Giải quyết được một số vấn đề thực tiễn gắn với đường tròn (ví dụ: một số bài toán liên quan đến chuyển động tròn trong Vật lí; tính được diện tích một số hình phẳng có thể đưa về những hình phẳng gắn với hình tròn, chẳng hạn hình viên phân,...)",
    "lesson_title": "LESSON-00026"
  }
]